bookers/app/controllers/bookers_controller.rb

INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "a"], ["body", "a"], ["created_at", "2026-05-05 15:22:28.273782"], ["updated_at", "2026-05-05 15:22:28.273782"]]
SELECT "books".* FROM "books"
---
  def create
    @book = Book.new(book_params)
    if @book.save
      flash[:notice] = 'Book was successfully created.'
     redirect_to show_books_path(@book.id)
    else
      @books = Book.all

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 29], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 29]]
---
  def destroy
    book = Book.find(params[:id])
    if book.delete